import React from "react"

export const DetailsPage = () => {
    return <>
        <table>
            <thead>
                <tr>
                    <th>种族</th>
                    <th>性别</th>
                    <th>是否可爱</th>
                </tr>
            </thead>
            <tbody>
                <tr>
                    <td>猫魅族</td>
                    <td>女性</td>
                    <td>√</td>
                </tr>
                <tr>
                    <td>硌狮族</td>
                    <td>男性</td>
                    <td>×</td>
                </tr>
            </tbody>
        </table>
        <h2> 如何捕捉猫娘</h2>
        <ol className="how-to-catch-a-miqote">
            <li>
                <h3>准备必备道具——巨型鱼骨抓猫器</h3>
                首先，你需要一把巨大的鱼骨头，最好是深海怪鱼的！然后，找一位铁匠帮你把鱼骨头制成一个巨大的抓猫器。别忘了，在抓猫器上装上一只超大号的铃铛，这样才能吸引猫娘的注意力！
            </li>
            <li>
                <h3>步骤二：筹备迷人的猫娘诱饵——无敌猫娘舞会</h3>
                为了吸引猫娘，你需要准备一个超级炫酷的猫娘舞会。找来最时尚的猫娘服装、炫彩灯光、最流行的音乐和香喷喷的猫薄荷气味，打造一个无法抵挡的舞会现场。确保猫娘们听说了这个盛大活动后，一定会前仆后继地赶来。
            </li>
            <li>
                <h3>步骤三：用爱和零食驯服猫娘——甜言蜜语计划</h3>
                当猫娘们到达猫娘舞会现场时，迅速展开你的甜言蜜语计划。用最温柔动听的声音和它们对话，夸赞它们的可爱、机灵和迷人之处。别忘了准备一些猫娘们喜欢的小零食，比如猫薄荷饼干、鱼肉脆片等等，让它们在欢快的音乐中享受美食的同时，逐渐与你建立起深厚的友谊。
            </li>
        </ol>
        <h2> 如何判断是否可爱</h2>
        <ul>
            <li>猫魅族</li>
            <li>女性</li>
        </ul>
    </>
}